benchmark-results/round-2-intel/dragon 12-3-9.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  39 secs]  0 threads:    96000000 ops, 3210609 (avg: 2415680) ops/sec, 207.86MB/sec (avg: 156.40MB/sec),  0.24 (avg:  0.32) msec latency

8         Threads
12        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      2591338.54          ---          ---         0.31728         0.29500         0.39100         0.47900         0.62300         0.73500         1.78300         1.91900         2.46300         3.31100    171800.46
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    2591338.54         0.00         0.00         0.31728         0.29500         0.39100         0.47900         0.62300         0.73500         1.78300         1.91900         2.46300         3.31100    171800.46
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  35 secs]  0 threads:    96000000 ops, 3528053 (avg: 2667606) ops/sec, 146.96MB/sec (avg: 111.09MB/sec),  0.22 (avg:  0.29) msec latency

8         Threads
12        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       250263.85          ---          ---         0.28728         0.27900         0.34300         0.39100         0.49500         0.56700         1.11900         1.23900         1.69500         2.19100     16617.41
Gets      2502610.93     27284.54   2475326.38         0.28713         0.27900         0.34300         0.39100         0.49500         0.56700         1.11900         1.23900         1.69500         2.19100    100770.67
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    2752874.78     27284.54   2475326.38         0.28714         0.27900         0.34300         0.39100         0.49500         0.56700         1.11900         1.23900         1.69500         2.19100    117388.08
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,   8 secs]  0 threads:     9600000 ops, 1176109 (avg: 1177642) ops/sec, 48.99MB/sec (avg: 49.06MB/sec),  0.08 (avg:  0.08) msec latency

8         Threads
12        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       110443.16          ---          ---         0.08242         0.08700         0.09500         0.10300         0.12700         0.14300         0.59100         0.84700         1.15100         1.23900      7333.33
Gets      1104419.47     13132.67   1091286.80         0.08171         0.08700         0.09500         0.10300         0.12700         0.14300         0.43900         0.78300         1.08700         1.26300     44494.01
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    1214862.63     13132.67   1091286.80         0.08177         0.08700         0.09500         0.10300         0.12700         0.14300         0.46300         0.79100         1.09500         1.26300     51827.34
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  40 secs]  0 threads:    96000000 ops, 3178648 (avg: 2354777) ops/sec, 192.01MB/sec (avg: 142.25MB/sec),  0.24 (avg:  0.32) msec latency

8         Threads
12        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       231541.19          ---          ---         0.32544         0.30300         0.39900         0.47900         0.62300         0.71900         1.16700         1.28700         1.69500         2.11100     15350.96
Gets      2315386.48   2315386.48         0.00         0.32532         0.30300         0.39900         0.47900         0.62300         0.71900         1.16700         1.29500         1.71100         2.15900    142199.56
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    2546927.67   2315386.48         0.00         0.32533         0.30300         0.39900         0.47900         0.62300         0.71900         1.16700         1.29500         1.71100         2.15900    157550.52
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,   7 secs]  0 threads:     9600000 ops, 1162459 (avg: 1211099) ops/sec, 70.22MB/sec (avg: 73.16MB/sec),  0.08 (avg:  0.08) msec latency

8         Threads
12        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       111262.68          ---          ---         0.07981         0.07900         0.10300         0.11100         0.13500         0.15900         0.39900         0.69500         1.03100         1.19900      7375.94
Gets      1112614.55   1112614.55         0.00         0.07950         0.07900         0.10300         0.11100         0.13500         0.15900         0.39100         0.67900         1.00700         1.19900     68330.52
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    1223877.23   1112614.55         0.00         0.07952         0.07900         0.10300         0.11100         0.13500         0.15900         0.39100         0.67900         1.00700         1.19900     75706.46